{"_id":{"$oid":"59098c540fb0ff0750806a86"},"updatedAt":{"$date":"2017-05-03T12:11:58.088Z"},"createdAt":{"$date":"2017-05-03T07:52:52.640Z"},"title":"Bonjour !","content":"raffin.jerome@gmail.com / admin\n\n1. Ce qu’est un fork Github ?\nC'est une copie d'un dépôt Github.\n\n2. A quoi sert-il ?\nCela permet d'apporter des modifications sur le projet sans modifier le dépôt d'origine.\n\n3. Qu’est-ce qu’une pull request ? Quel est l’intérêt ?\nUn pull request est une demande d'intégrer les modifications apportées par nos soins au dépôt d'origine. Elle permet d'apporter des solutions à certains bugs ou d'ajouter des nouvelles fonctionnalités.\n\n4. Qu’est-ce qu’une branche ?\nUne branche sert à développer de nouvelles fonctionnalités sans impacter le code d'origine.\n\n5. Quelle est la différence entre une branche et un fork ?\nUne branche est propre à chaque dépôt et un fork est une copie d'un dépôt (qui peut contenir plusieurs branches).","__v":0,"date":{"$date":"2017-05-03T11:25:52.137Z"},"published":true}
{"_id":{"$oid":"59098c700fb0ff0750806a87"},"updatedAt":{"$date":"2017-05-03T12:07:33.511Z"},"createdAt":{"$date":"2017-05-03T07:53:20.950Z"},"title":"La MEAN Stack","content":"Angular\nC'est un framework permettant de créer des applications web et mobiles. (côté front, indispensable)\n\nAngular UI Router\nC'est un module Angular permettant de gérer les routes/états de l'application (côté front, indispensable)\n\nExpress\nC'est un framework qui permet de créer des applications avec Node.js (côté back, indispensable)\n\nJSONWebToken\nIl permet d'échanger des informations (par exemple les infos d'un utilisateur) de manière sécurisé avec un jeton signé.\n\nMongoose\n\nMaterializeCSS\nC'est un framework css (côté front, facultatif)\n\nPassport\nC'est un middleware pour Node.js et permet de gérer l'authentification sur une application. (côté back, indispensable)\n\nBabel\nC'est un \"compiler\", il permet de compiler le code ES6 en ES5 pour qu'ils soient lus par tous les navigateurs. (terminal, indispensable)\n\nSCSS\n\nNodemon\nIl permet de surveiller les changements côté serveur et de redémarrer le serveur si c'est le cas (côté back, facultatif)\n\nWebpack\nC'est un pré-processeur, il permet de générer des bundles de nos applications. (terminal, indispensable)\n\nLivereload\nIl permet de rafraîchir l'application dans notre navigateur quand on effectue et sauvegarde nos modifications. (côté front, facultatif)\n\nLa MEAN Stack est composé de MongoDB, Express.js, AngularJS et Node.js, c'est un groupe de technologies permettant de créer des applications web et mobiles en Javascript, côté front (client side) comme côté back (server side).","__v":0,"date":{"$date":"2017-05-03T11:17:55.168Z"},"published":false}
{"_id":{"$oid":"5909e4252330b62392e47e90"},"updatedAt":{"$date":"2017-05-03T14:07:33.295Z"},"createdAt":{"$date":"2017-05-03T14:07:33.295Z"},"content":"Que sont les méthodes agiles ?\nCe sont des pratiques qui permettent de sans cesse s'adapter pendant le développement d'un projet.\n\nQu’est-ce que SCRUM ?\nSCRUM est un processus agile qui permet de produire des applications sur des cycles de développements courts et de durée fixe.\n\nDéfinir le Product BackLog, de quoi est-il constitué ?\nLe Product Backlog est un liste ordonnée de tout ce que l'application doit être capable de faire. Il est constitué d'items appelés \"User Stories\", chaque item contient un ordre, une description, une estimation, une valeur. On mentionne également quand l'item est terminé par \"done\".\n\nDéfinir le Product Owner\nLe product owner priorise les développements que l'équipe devra réaliser à chaque sprint. C'est lui qui construit le product backlog.\n\nDéfinir le SCRUM Master\nLe SCRUM Master est chargé de s'assurer que le processus SCRUM est proprement exécuté et que le rythme est maintenu. Cependant il n'est pas le \"chef\". Il est responsable de l'efficience et de l'efficacité du processus.\n\nDéfinir la « Development team »\nL'équipe de développement décident de leur façon de travailler et de leurs outils. Ce que produit l'équipe est déterminé par le product owner mais la manière dont cela est produit est décidé par l'équipe. L'équipe prend également en compte toutes les compétences.\n\nDéfinir le Sprint, de quoi est-il constitué ?\nLe Sprint est une période définie par les développeurs pendant laquelle un ensemble de users stories (découpés en tâches) vont être réalisées.\n\nDéfinir le daily scrum\n15 minutes max, toujours à la même heure, toujours au même endroit, toujours debout, le daily scrum permet d'avoir connaissance du travail réalisé par chacun depuis le dernier daily scrum, d'avoir une idée de ce qui va être réalisé dans les prochaines 24h et d'identifier les problèmes rencontrés.\n\nQu’est-ce que la planification d’un sprint ?\nLa planification d'un sprint permet de définir le travail à accomplir pendant le Sprint. L'équipe de développement sélectionne tous les items du Product Backlog qu'elle pense pouvoir réaliser pendant cette période.\n\nQu’est-ce que la révision d’un sprint ?\nLa révision d'un sprint est réalisé à la fin d'un sprint, l'équipe de développement va alors discuter des problèmes rencontrés pendant cette période et ce qui a été résolu et également ce qui a été terminé et non-terminé. Une démo du travail accompli est également faite.\n\nQu’est-ce que la rétrospective d’un sprint ?\nLa rétrospective d'un sprint dure 45mn par semaine de sprint. On identifie ce qui s'est bien déroulé et que l'on doit reproduire mais également identifier ce qui s'est mal passé et ce qui doit être corrigé.\n\nPourquoi est-il important de définir la notion de « Done » pour les tâches ?\nIl est important de définir cette notion afin de s'assurer que la tâche est bel et bien terminée, c'est à dire qu'elle est passée par une liste de vérifications , définie par exemple par le client et l'équipe dévéloppement\n\nLa notion de « Done » peut-elle évoluer au cours d’un projet SCRUM ?\nOui elle peut évoluer.\n\nSCRUM est-elle une méthodologie itérative ? Justifier.\nOui SCRUM est une méthodologie itérative car elle est rythmée par des itérations (sprints)","title":"Culture SCRUM","published":true,"date":{"$date":"2017-03-04T23:00:00.000Z"},"__v":0}
{"_id":{"$oid":"5909e6932330b62392e47e91"},"updatedAt":{"$date":"2017-05-03T14:39:40.529Z"},"createdAt":{"$date":"2017-05-03T14:17:55.225Z"},"title":"SCRUM - Product Backlog","content":"PRODUCT BACKLOG\n● Accéder à la partie administrateur\n   o Seul un administrateur peut accéder à l'administration\n   o Rediriger si je ne suis pas administrateur\n\n● Éditer un utilisateur\n   o Possibilité de définir si il est Admin ou non\n\n● Éditer un article\n   o Possibilité de modifier le titre, le contenu, la date de publication\n   o Possibilité de publier ou dépublier un article si administrateur\n\nSPRINT\n● Récupérer les infos de l'utilisateur côté back avec JSONWebToken (~30mn)\n● Protéger l'url et la route admin par la condition if(IsAdmin) (~10mn)\n● Créer une redirection si l'utilisateur n'est pas admin (~10mn)\n● Définir une route admin côté front (~10mn)\n● Créer un module et composant admin (~10mn)\n● Créer le template html de l'administration (~45mn)\n● Créer le style css de l'administration (~30mn)\n● Créer un module et composant articles (~30mn)","published":true,"date":{"$date":"2017-03-04T23:00:00.000Z"},"__v":0}
